In [1]:
%create TEST1.db

In [2]:
create table meibo
  (id int primary key, name varchar(20))

In [3]:
select * from meibo;

+----+------+
| id | name |
+----+------+

In [4]:
insert into meibo (id, name) values (1, "Yamada");

In [5]:
insert into meibo (id, name) values (2, "Tanaka");

In [6]:
insert into meibo (id, name) values (3, "Sato");

In [7]:
select * from meibo

+----+--------+
| id | name   |
+----+--------+
| 1  | Yamada |
+----+--------+
| 2  | Tanaka |
+----+--------+
| 3  | Sato   |
+----+--------+

In [8]:
insert into meibo (id, name) values (1, "Yamada");

Error: UNIQUE constraint failed: meibo.id

In [9]:
select name from sqlite_master where type='table';

+-------+
| name  |
+-------+
| meibo |
+-------+

In [14]:
select * from meibo where id=2;

+----+--------+
| id | name   |
+----+--------+
| 2  | Tanaka |
+----+--------+

In [15]:
select * from meibo where id in (1,2);

+----+--------+
| id | name   |
+----+--------+
| 1  | Yamada |
+----+--------+
| 2  | Tanaka |
+----+--------+

In [16]:
select * from meibo where name like 'S%';

+----+------+
| id | name |
+----+------+
| 3  | Sato |
+----+------+

In [17]:
update meibo
 set name = "Suzuki"
 where id=3;

In [18]:
select * from meibo;

+----+--------+
| id | name   |
+----+--------+
| 1  | Yamada |
+----+--------+
| 2  | Tanaka |
+----+--------+
| 3  | Suzuki |
+----+--------+

In [19]:
insert into meibo (id, name) values (4, "Dummy");

In [20]:
select * from meibo;

+----+--------+
| id | name   |
+----+--------+
| 1  | Yamada |
+----+--------+
| 2  | Tanaka |
+----+--------+
| 3  | Suzuki |
+----+--------+
| 4  | Dummy  |
+----+--------+

In [21]:
delete from meibo
where id = 4;

In [22]:
select * from meibo;

+----+--------+
| id | name   |
+----+--------+
| 1  | Yamada |
+----+--------+
| 2  | Tanaka |
+----+--------+
| 3  | Suzuki |
+----+--------+

In [23]:
alter table meibo add class int;

In [24]:
alter table meibo add age int;

In [25]:
select * from meibo;

+----+--------+-------+-----+
| id | name   | class | age |
+----+--------+-------+-----+
| 1  | Yamada |       |     |
+----+--------+-------+-----+
| 2  | Tanaka |       |     |
+----+--------+-------+-----+
| 3  | Suzuki |       |     |
+----+--------+-------+-----+

In [26]:
update meibo
 set class=1,age=13
 where id=3;

In [27]:
select * from meibo;

+----+--------+-------+-----+
| id | name   | class | age |
+----+--------+-------+-----+
| 1  | Yamada |       |     |
+----+--------+-------+-----+
| 2  | Tanaka |       |     |
+----+--------+-------+-----+
| 3  | Suzuki | 1     | 13  |
+----+--------+-------+-----+

In [28]:
update meibo
 set class=1,age=14
 where id=1;

In [29]:
 update meibo
 set class=2,age=13
 where id=2;

In [30]:
select * from meibo;

+----+--------+-------+-----+
| id | name   | class | age |
+----+--------+-------+-----+
| 1  | Yamada | 1     | 14  |
+----+--------+-------+-----+
| 2  | Tanaka | 2     | 13  |
+----+--------+-------+-----+
| 3  | Suzuki | 1     | 13  |
+----+--------+-------+-----+

In [31]:
insert into meibo (id,name,class,age) 
 values (4,"Kato",2,15),(5,"Ito",3,12),(6,"Takeuchi",2,16),(7,"Kimura",3,11),(8,"Sato",1,14);

In [32]:
select * from meibo;

+----+----------+-------+-----+
| id | name     | class | age |
+----+----------+-------+-----+
| 1  | Yamada   | 1     | 14  |
+----+----------+-------+-----+
| 2  | Tanaka   | 2     | 13  |
+----+----------+-------+-----+
| 3  | Suzuki   | 1     | 13  |
+----+----------+-------+-----+
| 4  | Kato     | 2     | 15  |
+----+----------+-------+-----+
| 5  | Ito      | 3     | 12  |
+----+----------+-------+-----+
| 6  | Takeuchi | 2     | 16  |
+----+----------+-------+-----+
| 7  | Kimura   | 3     | 11  |
+----+----------+-------+-----+
| 8  | Sato     | 1     | 14  |
+----+----------+-------+-----+

In [44]:
select count(*) from meibo;

+----------+
| count(*) |
+----------+
| 8        |
+----------+

In [45]:
select count(*) as cnt from meibo;

+-----+
| cnt |
+-----+
| 8   |
+-----+

In [46]:
select count(distinct class) as classCnt from meibo;

+----------+
| classCnt |
+----------+
| 3        |
+----------+

In [47]:
select avg(age) as avgAge from meibo;

+--------+
| avgAge |
+--------+
| 13.5   |
+--------+

In [48]:
select sum(age) / count(*) as avgAge from meibo;

+--------+
| avgAge |
+--------+
| 13     |
+--------+

In [49]:
select min(age) as minAge, max(age) as maxAge from meibo;

+--------+--------+
| minAge | maxAge |
+--------+--------+
| 11     | 16     |
+--------+--------+

In [50]:
select * from meibo order by id desc;

+----+----------+-------+-----+--------+
| id | name     | class | age | height |
+----+----------+-------+-----+--------+
| 8  | Sato     | 1     | 14  | 160    |
+----+----------+-------+-----+--------+
| 7  | Kimura   | 3     | 11  | 160    |
+----+----------+-------+-----+--------+
| 6  | Takeuchi | 2     | 16  | 155    |
+----+----------+-------+-----+--------+
| 5  | Ito      | 3     | 12  | 155    |
+----+----------+-------+-----+--------+
| 4  | Kato     | 2     | 15  | 150    |
+----+----------+-------+-----+--------+
| 3  | Suzuki   | 1     | 13  | 150    |
+----+----------+-------+-----+--------+
| 2  | Tanaka   | 2     | 13  | 150    |
+----+----------+-------+-----+--------+
| 1  | Yamada   | 1     | 14  | 150    |
+----+----------+-------+-----+--------+

In [51]:
select * from meibo order by age;

+----+----------+-------+-----+--------+
| id | name     | class | age | height |
+----+----------+-------+-----+--------+
| 7  | Kimura   | 3     | 11  | 160    |
+----+----------+-------+-----+--------+
| 5  | Ito      | 3     | 12  | 155    |
+----+----------+-------+-----+--------+
| 2  | Tanaka   | 2     | 13  | 150    |
+----+----------+-------+-----+--------+
| 3  | Suzuki   | 1     | 13  | 150    |
+----+----------+-------+-----+--------+
| 1  | Yamada   | 1     | 14  | 150    |
+----+----------+-------+-----+--------+
| 8  | Sato     | 1     | 14  | 160    |
+----+----------+-------+-----+--------+
| 4  | Kato     | 2     | 15  | 150    |
+----+----------+-------+-----+--------+
| 6  | Takeuchi | 2     | 16  | 155    |
+----+----------+-------+-----+--------+

In [52]:
select * from meibo order by class,age;

+----+----------+-------+-----+--------+
| id | name     | class | age | height |
+----+----------+-------+-----+--------+
| 3  | Suzuki   | 1     | 13  | 150    |
+----+----------+-------+-----+--------+
| 1  | Yamada   | 1     | 14  | 150    |
+----+----------+-------+-----+--------+
| 8  | Sato     | 1     | 14  | 160    |
+----+----------+-------+-----+--------+
| 2  | Tanaka   | 2     | 13  | 150    |
+----+----------+-------+-----+--------+
| 4  | Kato     | 2     | 15  | 150    |
+----+----------+-------+-----+--------+
| 6  | Takeuchi | 2     | 16  | 155    |
+----+----------+-------+-----+--------+
| 7  | Kimura   | 3     | 11  | 160    |
+----+----------+-------+-----+--------+
| 5  | Ito      | 3     | 12  | 155    |
+----+----------+-------+-----+--------+

In [53]:
select * from meibo limit 3;

+----+--------+-------+-----+--------+
| id | name   | class | age | height |
+----+--------+-------+-----+--------+
| 1  | Yamada | 1     | 14  | 150    |
+----+--------+-------+-----+--------+
| 2  | Tanaka | 2     | 13  | 150    |
+----+--------+-------+-----+--------+
| 3  | Suzuki | 1     | 13  | 150    |
+----+--------+-------+-----+--------+

In [54]:
select * from meibo where class=2 and age>=15;

+----+----------+-------+-----+--------+
| id | name     | class | age | height |
+----+----------+-------+-----+--------+
| 4  | Kato     | 2     | 15  | 150    |
+----+----------+-------+-----+--------+
| 6  | Takeuchi | 2     | 16  | 155    |
+----+----------+-------+-----+--------+

In [55]:
select * from meibo where class=1 or age>=15;

+----+----------+-------+-----+--------+
| id | name     | class | age | height |
+----+----------+-------+-----+--------+
| 1  | Yamada   | 1     | 14  | 150    |
+----+----------+-------+-----+--------+
| 3  | Suzuki   | 1     | 13  | 150    |
+----+----------+-------+-----+--------+
| 4  | Kato     | 2     | 15  | 150    |
+----+----------+-------+-----+--------+
| 6  | Takeuchi | 2     | 16  | 155    |
+----+----------+-------+-----+--------+
| 8  | Sato     | 1     | 14  | 160    |
+----+----------+-------+-----+--------+

In [59]:
select class, count(*) as num from meibo group by class;

+-------+-----+
| class | num |
+-------+-----+
| 1     | 3   |
+-------+-----+
| 2     | 3   |
+-------+-----+
| 3     | 2   |
+-------+-----+

In [60]:
select class, count(*) as num, avg(age) as avgAge from meibo group by class;

+-------+-----+------------------+
| class | num | avgAge           |
+-------+-----+------------------+
| 1     | 3   | 13.6666666666667 |
+-------+-----+------------------+
| 2     | 3   | 14.6666666666667 |
+-------+-----+------------------+
| 3     | 2   | 11.5             |
+-------+-----+------------------+

In [61]:
select class, avg(age) as avgAge from meibo group by class having avgAge>13;

+-------+------------------+
| class | avgAge           |
+-------+------------------+
| 1     | 13.6666666666667 |
+-------+------------------+
| 2     | 14.6666666666667 |
+-------+------------------+

In [62]:
select class, avg(age) as avgAge from meibo where age > 13 group by class;

+-------+--------+
| class | avgAge |
+-------+--------+
| 1     | 14.0   |
+-------+--------+
| 2     | 15.5   |
+-------+--------+

In [63]:
select class, age, count(*) as num from meibo group by class,age;

+-------+-----+-----+
| class | age | num |
+-------+-----+-----+
| 1     | 13  | 1   |
+-------+-----+-----+
| 1     | 14  | 2   |
+-------+-----+-----+
| 2     | 13  | 1   |
+-------+-----+-----+
| 2     | 15  | 1   |
+-------+-----+-----+
| 2     | 16  | 1   |
+-------+-----+-----+
| 3     | 11  | 1   |
+-------+-----+-----+
| 3     | 12  | 1   |
+-------+-----+-----+

In [64]:
select class, age, count(*) as num from meibo group by 1,2;

+-------+-----+-----+
| class | age | num |
+-------+-----+-----+
| 1     | 13  | 1   |
+-------+-----+-----+
| 1     | 14  | 2   |
+-------+-----+-----+
| 2     | 13  | 1   |
+-------+-----+-----+
| 2     | 15  | 1   |
+-------+-----+-----+
| 2     | 16  | 1   |
+-------+-----+-----+
| 3     | 11  | 1   |
+-------+-----+-----+
| 3     | 12  | 1   |
+-------+-----+-----+

In [68]:
/*前の練習問題で作成したテーブルは使わないので、一旦削除します*/
drop table if exists meibo2;

In [69]:
/* class=100000は存在しないため、レコードは０*/
create table meibo2 as select * from meibo where class=10000;

In [70]:
/*データの確認*/
select * from  meibo2;

+----+------+-------+-----+--------+
| id | name | class | age | height |
+----+------+-------+-----+--------+

In [71]:
insert into meibo2 (id,name,class,age,height) 
 values (1,"Yamada",1,14,150),
        (9,"Nagata",4,11,160),
        (10,"Sugino",2,13,150),
        (11,"Takayama",1,14,155),
        (12,"John",3,16,165);

In [72]:
select * from  meibo2;

+----+----------+-------+-----+--------+
| id | name     | class | age | height |
+----+----------+-------+-----+--------+
| 1  | Yamada   | 1     | 14  | 150    |
+----+----------+-------+-----+--------+
| 9  | Nagata   | 4     | 11  | 160    |
+----+----------+-------+-----+--------+
| 10 | Sugino   | 2     | 13  | 150    |
+----+----------+-------+-----+--------+
| 11 | Takayama | 1     | 14  | 155    |
+----+----------+-------+-----+--------+
| 12 | John     | 3     | 16  | 165    |
+----+----------+-------+-----+--------+

In [73]:
select * from  meibo
union
select * from  meibo2;

+----+----------+-------+-----+--------+
| id | name     | class | age | height |
+----+----------+-------+-----+--------+
| 1  | Yamada   | 1     | 14  | 150    |
+----+----------+-------+-----+--------+
| 2  | Tanaka   | 2     | 13  | 150    |
+----+----------+-------+-----+--------+
| 3  | Suzuki   | 1     | 13  | 150    |
+----+----------+-------+-----+--------+
| 4  | Kato     | 2     | 15  | 150    |
+----+----------+-------+-----+--------+
| 5  | Ito      | 3     | 12  | 155    |
+----+----------+-------+-----+--------+
| 6  | Takeuchi | 2     | 16  | 155    |
+----+----------+-------+-----+--------+
| 7  | Kimura   | 3     | 11  | 160    |
+----+----------+-------+-----+--------+
| 8  | Sato     | 1     | 14  | 160    |
+----+----------+-------+-----+--------+
| 9  | Nagata   | 4     | 11  | 160    |
+----+----------+-------+-----+--------+
| 10 | Sugino   | 2     | 13  | 150    |
+----+----------+-------+-----+--------+
| 11 | Takayama | 1     | 14  | 155    |
+----+----------+-------+-----+--------+
| 12 | John     | 3     | 16  | 165    |
+----+----------+-------+-----+--------+

In [74]:
select * from  meibo
union all
select * from  meibo2;

+----+----------+-------+-----+--------+
| id | name     | class | age | height |
+----+----------+-------+-----+--------+
| 1  | Yamada   | 1     | 14  | 150    |
+----+----------+-------+-----+--------+
| 2  | Tanaka   | 2     | 13  | 150    |
+----+----------+-------+-----+--------+
| 3  | Suzuki   | 1     | 13  | 150    |
+----+----------+-------+-----+--------+
| 4  | Kato     | 2     | 15  | 150    |
+----+----------+-------+-----+--------+
| 5  | Ito      | 3     | 12  | 155    |
+----+----------+-------+-----+--------+
| 6  | Takeuchi | 2     | 16  | 155    |
+----+----------+-------+-----+--------+
| 7  | Kimura   | 3     | 11  | 160    |
+----+----------+-------+-----+--------+
| 8  | Sato     | 1     | 14  | 160    |
+----+----------+-------+-----+--------+
| 1  | Yamada   | 1     | 14  | 150    |
+----+----------+-------+-----+--------+
| 9  | Nagata   | 4     | 11  | 160    |
+----+----------+-------+-----+--------+
| 10 | Sugino   | 2     | 13  | 150    |
+----+----------+-------+-----+--------+
| 11 | Takayama | 1     | 14  | 155    |
+----+----------+-------+-----+--------+
| 12 | John     | 3     | 16  | 165    |
+----+----------+-------+-----+--------+

In [75]:
create table score
  (id int primary key, math int, english int,science int)

In [76]:
insert into score (id,math,english,science) 
 values (1,10,10,40),(2,NULL,60,100),(3,30,40,60),
        (5,25,31,10),(6,50,30,10),(8,90,100,90),
        (9,67,71,50),(11,100,40,88),(15,76,21,13);

In [77]:
select * from score;

+----+------+---------+---------+
| id | math | english | science |
+----+------+---------+---------+
| 1  | 10   | 10      | 40      |
+----+------+---------+---------+
| 2  |      | 60      | 100     |
+----+------+---------+---------+
| 3  | 30   | 40      | 60      |
+----+------+---------+---------+
| 5  | 25   | 31      | 10      |
+----+------+---------+---------+
| 6  | 50   | 30      | 10      |
+----+------+---------+---------+
| 8  | 90   | 100     | 90      |
+----+------+---------+---------+
| 9  | 67   | 71      | 50      |
+----+------+---------+---------+
| 11 | 100  | 40      | 88      |
+----+------+---------+---------+
| 15 | 76   | 21      | 13      |
+----+------+---------+---------+

In [78]:
select * from meibo a join score b on a.id=b.id;

+----+----------+-------+-----+--------+----+------+---------+---------+
| id | name     | class | age | height | id | math | english | science |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 1  | Yamada   | 1     | 14  | 150    | 1  | 10   | 10      | 40      |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 2  | Tanaka   | 2     | 13  | 150    | 2  |      | 60      | 100     |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 3  | Suzuki   | 1     | 13  | 150    | 3  | 30   | 40      | 60      |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 5  | Ito      | 3     | 12  | 155    | 5  | 25   | 31      | 10      |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 6  | Takeuchi | 2     | 16  | 155    | 6  | 50   | 30      | 10      |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 8  | Sato     | 1     | 14  | 160    | 8  | 90   | 100     | 90      |
+----+----------+-------+-----+--------+----+------+---------+---------+

In [79]:
select * from meibo a left join score b on a.id=b.id;

+----+----------+-------+-----+--------+----+------+---------+---------+
| id | name     | class | age | height | id | math | english | science |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 1  | Yamada   | 1     | 14  | 150    | 1  | 10   | 10      | 40      |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 2  | Tanaka   | 2     | 13  | 150    | 2  |      | 60      | 100     |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 3  | Suzuki   | 1     | 13  | 150    | 3  | 30   | 40      | 60      |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 4  | Kato     | 2     | 15  | 150    |    |      |         |         |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 5  | Ito      | 3     | 12  | 155    | 5  | 25   | 31      | 10      |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 6  | Takeuchi | 2     | 16  | 155    | 6  | 50   | 30      | 10      |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 7  | Kimura   | 3     | 11  | 160    |    |      |         |         |
+----+----------+-------+-----+--------+----+------+---------+---------+
| 8  | Sato     | 1     | 14  | 160    | 8  | 90   | 100     | 90      |
+----+----------+-------+-----+--------+----+------+---------+---------+

In [80]:
select * from meibo a join meibo b on a.id=b.id;

+----+----------+-------+-----+--------+----+----------+-------+-----+--------+
| id | name     | class | age | height | id | name     | class | age | height |
+----+----------+-------+-----+--------+----+----------+-------+-----+--------+
| 1  | Yamada   | 1     | 14  | 150    | 1  | Yamada   | 1     | 14  | 150    |
+----+----------+-------+-----+--------+----+----------+-------+-----+--------+
| 2  | Tanaka   | 2     | 13  | 150    | 2  | Tanaka   | 2     | 13  | 150    |
+----+----------+-------+-----+--------+----+----------+-------+-----+--------+
| 3  | Suzuki   | 1     | 13  | 150    | 3  | Suzuki   | 1     | 13  | 150    |
+----+----------+-------+-----+--------+----+----------+-------+-----+--------+
| 4  | Kato     | 2     | 15  | 150    | 4  | Kato     | 2     | 15  | 150    |
+----+----------+-------+-----+--------+----+----------+-------+-----+--------+
| 5  | Ito      | 3     | 12  | 155    | 5  | Ito      | 3     | 12  | 155    |
+----+----------+-------+-----+--------+----+----------+-------+-----+--------+
| 6  | Takeuchi | 2     | 16  | 155    | 6  | Takeuchi | 2     | 16  | 155    |
+----+----------+-------+-----+--------+----+----------+-------+-----+--------+
| 7  | Kimura   | 3     | 11  | 160    | 7  | Kimura   | 3     | 11  | 160    |
+----+----------+-------+-----+--------+----+----------+-------+-----+--------+
| 8  | Sato     | 1     | 14  | 160    | 8  | Sato     | 1     | 14  | 160    |
+----+----------+-------+-----+--------+----+----------+-------+-----+--------+

In [86]:
select 
     id, name
    ,case 
        when class = 1 then "A"
        when class = 2 then "B"
        when class = 3 then "C"
        else "others" 
    end as className
from 
    meibo;

+----+----------+-----------+
| id | name     | className |
+----+----------+-----------+
| 1  | Yamada   | A         |
+----+----------+-----------+
| 2  | Tanaka   | B         |
+----+----------+-----------+
| 3  | Suzuki   | A         |
+----+----------+-----------+
| 4  | Kato     | B         |
+----+----------+-----------+
| 5  | Ito      | C         |
+----+----------+-----------+
| 6  | Takeuchi | B         |
+----+----------+-----------+
| 7  | Kimura   | C         |
+----+----------+-----------+
| 8  | Sato     | A         |
+----+----------+-----------+

In [87]:
select b.name,b.age from 
 (select a.age,a.name from meibo a where a.class = 1) b;

+--------+-----+
| name   | age |
+--------+-----+
| Yamada | 14  |
+--------+-----+
| Suzuki | 13  |
+--------+-----+
| Sato   | 14  |
+--------+-----+

In [88]:
select b.* from 
 (select a.* from meibo a where a.class = 1) b;

+----+--------+-------+-----+--------+
| id | name   | class | age | height |
+----+--------+-------+-----+--------+
| 1  | Yamada | 1     | 14  | 150    |
+----+--------+-------+-----+--------+
| 3  | Suzuki | 1     | 13  | 150    |
+----+--------+-------+-----+--------+
| 8  | Sato   | 1     | 14  | 160    |
+----+--------+-------+-----+--------+

In [92]:
create view v1
    as
select id,name
    from meibo;

In [93]:
select * from v1;

+----+----------+
| id | name     |
+----+----------+
| 1  | Yamada   |
+----+----------+
| 2  | Tanaka   |
+----+----------+
| 3  | Suzuki   |
+----+----------+
| 4  | Kato     |
+----+----------+
| 5  | Ito      |
+----+----------+
| 6  | Takeuchi |
+----+----------+
| 7  | Kimura   |
+----+----------+
| 8  | Sato     |
+----+----------+

In [94]:
create view v2
    as
select 
     id
    ,name
    ,case 
        when class = 1 then "A"
        when class = 2 then "B"
        when class = 3 then "C"
        else "others" 
    end as className
from 
    meibo;

In [95]:
select * from v2;

+----+----------+-----------+
| id | name     | className |
+----+----------+-----------+
| 1  | Yamada   | A         |
+----+----------+-----------+
| 2  | Tanaka   | B         |
+----+----------+-----------+
| 3  | Suzuki   | A         |
+----+----------+-----------+
| 4  | Kato     | B         |
+----+----------+-----------+
| 5  | Ito      | C         |
+----+----------+-----------+
| 6  | Takeuchi | B         |
+----+----------+-----------+
| 7  | Kimura   | C         |
+----+----------+-----------+
| 8  | Sato     | A         |
+----+----------+-----------+

In [96]:
insert into v1 (id, name) values (100, "dummy_Yamada");

Error: cannot modify v1 because it is a view

In [97]:
select name, sql from sqlite_master where type = 'view';

+------+---------------------------------+
| name | sql                             |
+------+---------------------------------+
| v1   | CREATE VIEW v1                  |
|      | as                              |
|      | select id,name                  |
|      | from meibo                      |
+------+---------------------------------+
| v2   | CREATE VIEW v2                  |
|      | as                              |
|      | select                          |
|      | id                              |
|      | ,name                           |
|      | ,case                           |
|      | when class = 1 then "A"         |
|      | when class = 2 then "B"         |
|      | when class = 3 then "C"         |
|      | else "others"                   |
|      | end as className                |
|      | from                            |
|      | meibo                           |
+------+---------------------------------+